<?php

namespace Database\Seeders;

use App\Models\Article;
use Illuminate\Database\Seeder;

class ArticleSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Article::create([
            'user_id' => 1,
            'title' => 'فوائد التمور للصحة',
            'content' => 'التمور هي مصدر غني بالفيتامينات والمعادن التي تعزز صحة الجسم. تحتوي التمور على الألياف التي تساعد في تحسين عملية الهضم وتقوية الجهاز المناعي.يمكن تناول التمور كوجبة خفيفة أو إضافتها إلى الحلويات والمشروبات.',
            'image_url' => 'images/articles/article2.png',
        ]);

        Article::create([
            'user_id' => 1,
            'title' => 'أفضل أنواع التمور',
            'content' => 'تشتهر المملكة العربية السعودية بإنتاج أفضل أنواع التمور مثل السكري والخلاص والعجوة. تتميز هذه الأنواع بمذاقها الفريد وقيمتها الغذائية العالية.تعتبر التمور خيارًا مثاليًا للوجبات الصحية والطاقة الطبيعية.',
            'image_url' => 'images/articles/article1.png',
        ]);

        Article::create([
            'user_id' => 1,
            'title' => 'كيفية تخزين التمور بشكل صحيح',
            'content' => 'للحفاظ على جودة التمور، يُفضل تخزينها في مكان بارد وجاف بعيدًا عن أشعة الشمس المباشرة. يمكن أيضًا تخزينها في الثلاجة لفترات أطول.تأكد من استخدام عبوات محكمة الإغلاق للحفاظ على نضارتها.',
            'image_url' => 'images/articles/article2.png',
        ]);

        Article::create([
            'user_id' => 1,
            'title' => 'وصفات لذيذة باستخدام التمور',
            'content' => 'يمكن استخدام التمور في العديد من الوصفات مثل الكعك، العصائر، والسلطات. تضيف التمور نكهة حلوة طبيعية وقيمة غذائية عالية إلى الأطباق.جرب وصفة كرات التمر مع المكسرات للحصول على وجبة خفيفة صحية ولذيذة.',
            'image_url' => 'images/articles/article1.png',
        ]);
    }
}
